# VendorIdAttribute Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
VendorIdAttribute Class
Members See Also
---
The custom VendorId attribute for Macros macros use only.
**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class VendorIdAttribute : Attribute
```

Visual Basic
---
```text
Public Class VendorIdAttribute _
	Inherits Attribute
```

Visual C++
---
```text
public ref class VendorIdAttribute : public Attribute
```

# Inheritance Hierarchy
System..::..Object System..::..Attribute Autodesk.Revit.DB.Macros..::..VendorIdAttribute
# See Also
VendorIdAttribute Members
Autodesk.Revit.DB.Macros Namespace